# Основы

print('Hello world!')
print('Исповедуй принцип "Стань независим от других!"')
#
# Целостные числа - int: 5, 200 , 1000
#
# Числа с плавающей запятой - float: 5.5, 200.1 , 1000.04 - (ставим точку)
#
# Строки - str: "hello", 'Ювентрус'
#
# Булевый тип данных - boolean: true или false
#
Список: [1, 2, 4, 228]

Множества: {"Alex", "Semen", "Nastya", "Olga"}

Словарь: {"Папа":"Alex", "Мама":"Olga", "Сын":"Semen", "Дочь":"Nastya"}

# Переменная - поименованная или адресуемая иным способом область памяти, которую можно использовать для доступа к данным.
# 1. Первым символом переменной должна идти буква или нижнее подчеркивание, т.е. var или _var.
# 2. Все символы, кроме первого, могут быть буквой из нижнего регистра,верхнего регистра и цифрами, т.е. Var -> ошибка, пиши vAr или var123
# 3. Имя переменной не должно содержать пробелов или спец символов, firstName -> Ошибка (как и first name или !var#), пиши first_name.

# Пример того как должно быть:
num_1 = 3
num_2 = 5
result = num_1 + num_2
print(result)

